app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
SELECT  "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"
SELECT  "authors".* FROM "authors" ORDER BY "authors"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @q = Post.order(created_at: :desc).ransack(params[:q])
    @posts = @q.result.page(params[:page]).per(2)
    @new_posts = Post.find_newest_article
    @author = Author.first

INSERT INTO "posts" ("title", "body", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "なるなる"], ["body", "テスト"], ["category", "カテゴリ"], ["created_at", "2018-03-17 04:48:20.113112"], ["updated_at", "2018-03-17 04:48:20.113112"]]
---
  def create
    @post = Post.new(post_params) # ストロングパラメータを引数に
    @post.save # saveをしてデータベースに保存する。

UPDATE "posts" SET "category" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["category", "０００００００００００００００００００００００００００００００００００００００００００００００００００００００００００００００００００００００００００００００００００００００００００００００００００００００００"], ["updated_at", "2018-03-17 06:21:38.686069"], ["id", 8]]
---
  def update
    @post.update(post_params)